[Timeout] BlockStatement
htdocs/tonica-imobiliaria/classes/Imovel.js:2:146
 class Imovel {
-    constructor({id, rua, bairro, numero, cep, area, descricao, proprietarioAntigo, proprietarioNovo, precoCompra, precoVenda, precoMinimoVenda}){
-        this.id = id;
-        this.rua = rua;
-        this.bairro = bairro;
-        this.numero = numero;
-        this.cep = cep;
-        this.area = area;
-        this.descricao = descricao;
-        this.proprietarioAntigo = proprietarioAntigo;
-        this.proprietarioNovo = proprietarioNovo;
-        this.precoCompra = precoCompra;
-        this.precoVenda = precoVenda;
-        this.precoMinimoVenda = precoMinimoVenda;
-    }
+    constructor({id, rua, bairro, numero, cep, area, descricao, proprietarioAntigo, proprietarioNovo, precoCompra, precoVenda, precoMinimoVenda}){}
 
     validar() {

[Timeout] ArrayDeclaration
htdocs/tonica-imobiliaria/classes/Imovel.js:19:48
 
     validar() {
         let camposCaracteres = ["rua", "bairro", "descricao"];
-        let camposCaracteresRanges = [[1, 50], [1, 20], [1, 100]];
+        let camposCaracteresRanges = [[1, 50], [], [1, 100]];
         let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "precoCompra", "precoMinimoVenda"];
 

[Timeout] ArrayDeclaration
htdocs/tonica-imobiliaria/classes/Imovel.js:19:57
 
     validar() {
         let camposCaracteres = ["rua", "bairro", "descricao"];
-        let camposCaracteresRanges = [[1, 50], [1, 20], [1, 100]];
+        let camposCaracteresRanges = [[1, 50], [1, 20], []];
         let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "precoCompra", "precoMinimoVenda"];
 

[Timeout] StringLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:20:79
     validar() {
         let camposCaracteres = ["rua", "bairro", "descricao"];
         let camposCaracteresRanges = [[1, 50], [1, 20], [1, 100]];
-        let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "precoCompra", "precoMinimoVenda"];
+        let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "", "precoMinimoVenda"];
 
         let imovel = this;

[Timeout] StringLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:20:94
     validar() {
         let camposCaracteres = ["rua", "bairro", "descricao"];
         let camposCaracteresRanges = [[1, 50], [1, 20], [1, 100]];
-        let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "precoCompra", "precoMinimoVenda"];
+        let camposNumericos = ["area", "cep", "numero", "proprietarioAntigo", "precoCompra", ""];
 
         let imovel = this;

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/Imovel.js:24:59
 
         let imovel = this;
     
-        for (let i = 0; i < camposCaracteres.length; i++) {
-    
-            //Testa se os campos de caractares possuem somente letras e espaços
-            if (!/^[ a-z]+$/i.test(imovel[camposCaracteres[i]])) {
-                return false;
-            }
-    
-            //Testa se os campos de caracteres de quantidades adequadas de caractares
-            if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
-                imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
-                return false;
-            }
-        }
+        for (let i = 0; i < camposCaracteres.length; i++) {}
     
         for (let i = 0; i < camposNumericos.length; i++) {

[Killed] UpdateOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:24:54
 
         let imovel = this;
     
-        for (let i = 0; i < camposCaracteres.length; i++) {
+        for (let i = 0; i < camposCaracteres.length; i--) {
     
             //Testa se os campos de caractares possuem somente letras e espaços

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:27:17
         for (let i = 0; i < camposCaracteres.length; i++) {
     
             //Testa se os campos de caractares possuem somente letras e espaços
-            if (!/^[ a-z]+$/i.test(imovel[camposCaracteres[i]])) {
+            if (/^[ a-z]+$/i.test(imovel[camposCaracteres[i]])) {
                 return false;
             }

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:27:17
         for (let i = 0; i < camposCaracteres.length; i++) {
     
             //Testa se os campos de caractares possuem somente letras e espaços
-            if (!/^[ a-z]+$/i.test(imovel[camposCaracteres[i]])) {
+            if (true) {
                 return false;
             }

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:28:24
     
             //Testa se os campos de caractares possuem somente letras e espaços
             if (!/^[ a-z]+$/i.test(imovel[camposCaracteres[i]])) {
-                return false;
+                return true;
             }
     

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:32:17
             }
     
             //Testa se os campos de caracteres de quantidades adequadas de caractares
-            if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
+            if (imovel[camposCaracteres[i]].length >= camposCaracteresRanges[i][0] ||
                 imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
                 return false;

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:32:17
             }
     
             //Testa se os campos de caracteres de quantidades adequadas de caractares
-            if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
-                imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
+            if (true) {
                 return false;
             }

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:33:17
     
             //Testa se os campos de caracteres de quantidades adequadas de caractares
             if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
-                imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
+                true) {
                 return false;
             }

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:33:17
     
             //Testa se os campos de caracteres de quantidades adequadas de caractares
             if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
-                imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
+                imovel[camposCaracteres[i]].length <= camposCaracteresRanges[i][1]) {
                 return false;
             }

[Survived] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:34:24
             //Testa se os campos de caracteres de quantidades adequadas de caractares
             if (imovel[camposCaracteres[i]].length < camposCaracteresRanges[i][0] ||
                 imovel[camposCaracteres[i]].length > camposCaracteresRanges[i][1]) {
-                return false;
+                return true;
             }
         }

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:38:25
             }
         }
     
-        for (let i = 0; i < camposNumericos.length; i++) {
+        for (let i = 0; i <= camposNumericos.length; i++) {
     
             //Testa se os números possuem pelo menos 1 algarísmo

[Killed] UpdateOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:38:53
             }
         }
     
-        for (let i = 0; i < camposNumericos.length; i++) {
+        for (let i = 0; i < camposNumericos.length; i--) {
     
             //Testa se os números possuem pelo menos 1 algarísmo

[Survived] ArithmeticOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:41:31
         for (let i = 0; i < camposNumericos.length; i++) {
     
             //Testa se os números possuem pelo menos 1 algarísmo
-            let numToString = "" + imovel[camposNumericos[i]];
+            let numToString = "" - imovel[camposNumericos[i]];
             if (numToString.length < 1) {
                 return false;

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:42:17
     
             //Testa se os números possuem pelo menos 1 algarísmo
             let numToString = "" + imovel[camposNumericos[i]];
-            if (numToString.length < 1) {
+            if (numToString.length <= 1) {
                 return false;
             }

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:42:17
     
             //Testa se os números possuem pelo menos 1 algarísmo
             let numToString = "" + imovel[camposNumericos[i]];
-            if (numToString.length < 1) {
+            if (numToString.length >= 1) {
                 return false;
             }

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:43:24
             //Testa se os números possuem pelo menos 1 algarísmo
             let numToString = "" + imovel[camposNumericos[i]];
             if (numToString.length < 1) {
-                return false;
+                return true;
             }
     

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:47:17
             }
     
             //Testa se os campos numericos possuem somente números
-            if (!/^[0-9]+$/.test(imovel[camposNumericos[i]])) {
+            if (true) {
                 return false;
             }

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:47:17
             }
     
             //Testa se os campos numericos possuem somente números
-            if (!/^[0-9]+$/.test(imovel[camposNumericos[i]])) {
+            if (/^[0-9]+$/.test(imovel[camposNumericos[i]])) {
                 return false;
             }

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:48:24
     
             //Testa se os campos numericos possuem somente números
             if (!/^[0-9]+$/.test(imovel[camposNumericos[i]])) {
-                return false;
+                return true;
             }
     

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:52:17
             }
     
             //Testa se os valores nos campos numéricos são não negativos
-            if (imovel[camposNumericos[i]] < 0) {
+            if (true) {
                 return false;
             }

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:52:17
             }
     
             //Testa se os valores nos campos numéricos são não negativos
-            if (imovel[camposNumericos[i]] < 0) {
+            if (imovel[camposNumericos[i]] <= 0) {
                 return false;
             }

[Survived] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:53:24
     
             //Testa se os valores nos campos numéricos são não negativos
             if (imovel[camposNumericos[i]] < 0) {
-                return false;
+                return true;
             }
         }

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/Imovel.js:57:16
             }
         }
     
-        return true;
+        return false;
     }
 }
