[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:4:19
 import Imovel from './Imovel.js';
 
 class ImovelDBI {
-    constructor() {
-        this.imoveis = [];
-    }
+    constructor() {}
 
     insereImovel(imovel) {

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:8:26
         this.imoveis = [];
     }
 
-    insereImovel(imovel) {
-        this.imoveis.push({...imovel});
-    }
+    insereImovel(imovel) {}
 
     //Recebe o id de um imóvel e tenta removê-lo, se um imóvel com aquele ID for encontrado e removido, a função retorna TRUE, caso contrário, FALSE

[Killed] ObjectLiteral
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:9:27
     }
 
     insereImovel(imovel) {
-        this.imoveis.push({...imovel});
+        this.imoveis.push({});
     }
 

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:13:22
     }
 
     //Recebe o id de um imóvel e tenta removê-lo, se um imóvel com aquele ID for encontrado e removido, a função retorna TRUE, caso contrário, FALSE
-    removeImovel(id) {
-        let wasRemoved = false;
-        for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
-                this.imoveis.splice(i, 1);
-                wasRemoved = true;
-                break;
-            }
-        }
-
-        return wasRemoved;
-    }
+    removeImovel(id) {}
 
     //Retorna o imóvel que com o id passado como argumento, returnua null caso não existe imóvel com o id passado

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:14:26
 
     //Recebe o id de um imóvel e tenta removê-lo, se um imóvel com aquele ID for encontrado e removido, a função retorna TRUE, caso contrário, FALSE
     removeImovel(id) {
-        let wasRemoved = false;
+        let wasRemoved = true;
         for (let i = 0; i < this.imoveis.length; i++) {
             if (this.imoveis[i].id == id) {

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:15:25
     //Recebe o id de um imóvel e tenta removê-lo, se um imóvel com aquele ID for encontrado e removido, a função retorna TRUE, caso contrário, FALSE
     removeImovel(id) {
         let wasRemoved = false;
-        for (let i = 0; i < this.imoveis.length; i++) {
+        for (let i = 0; i >= this.imoveis.length; i++) {
             if (this.imoveis[i].id == id) {
                 this.imoveis.splice(i, 1);

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:15:25
     //Recebe o id de um imóvel e tenta removê-lo, se um imóvel com aquele ID for encontrado e removido, a função retorna TRUE, caso contrário, FALSE
     removeImovel(id) {
         let wasRemoved = false;
-        for (let i = 0; i < this.imoveis.length; i++) {
+        for (let i = 0; false; i++) {
             if (this.imoveis[i].id == id) {
                 this.imoveis.splice(i, 1);

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:16:17
     removeImovel(id) {
         let wasRemoved = false;
         for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
+            if (true) {
                 this.imoveis.splice(i, 1);
                 wasRemoved = true;

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:16:17
     removeImovel(id) {
         let wasRemoved = false;
         for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
+            if (this.imoveis[i].id != id) {
                 this.imoveis.splice(i, 1);
                 wasRemoved = true;

[Killed] BooleanLiteral
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:18:30
         for (let i = 0; i < this.imoveis.length; i++) {
             if (this.imoveis[i].id == id) {
                 this.imoveis.splice(i, 1);
-                wasRemoved = true;
+                wasRemoved = false;
                 break;
             }

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:27:26
     }
 
     //Retorna o imóvel que com o id passado como argumento, returnua null caso não existe imóvel com o id passado
-    buscaImovelPorId(id) {
-        let imovel = null;
-
-        for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
-                imovel = { ...this.imoveis[i] };
-            }
-        }
-
-        return imovel;
-    }
+    buscaImovelPorId(id) {}
 
     //Retorna um array com todos os imóveis cadastrados

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:30:25
     buscaImovelPorId(id) {
         let imovel = null;
 
-        for (let i = 0; i < this.imoveis.length; i++) {
+        for (let i = 0; false; i++) {
             if (this.imoveis[i].id == id) {
                 imovel = { ...this.imoveis[i] };

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:30:55
     buscaImovelPorId(id) {
         let imovel = null;
 
-        for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
-                imovel = { ...this.imoveis[i] };
-            }
-        }
+        for (let i = 0; i < this.imoveis.length; i++) {}
 
         return imovel;

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:31:43
         let imovel = null;
 
         for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
-                imovel = { ...this.imoveis[i] };
-            }
+            if (this.imoveis[i].id == id) {}
         }
 

[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:31:17
         let imovel = null;
 
         for (let i = 0; i < this.imoveis.length; i++) {
-            if (this.imoveis[i].id == id) {
+            if (false) {
                 imovel = { ...this.imoveis[i] };
             }

[Killed] ObjectLiteral
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:32:26
 
         for (let i = 0; i < this.imoveis.length; i++) {
             if (this.imoveis[i].id == id) {
-                imovel = { ...this.imoveis[i] };
+                imovel = {};
             }
         }

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:40:20
     }
 
     //Retorna um array com todos os imóveis cadastrados
-    buscaImoveis() {
-        let imoveis = [];
-        for (let i = 0; i < this.imoveis.length; i++) {
-            imoveis.push({...this.imoveis[i]});
-        }
-
-        return imoveis;
-    }
+    buscaImoveis() {}
 }
 

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:42:25
     //Retorna um array com todos os imóveis cadastrados
     buscaImoveis() {
         let imoveis = [];
-        for (let i = 0; i < this.imoveis.length; i++) {
+        for (let i = 0; i <= this.imoveis.length; i++) {
             imoveis.push({...this.imoveis[i]});
         }

[Killed] BlockStatement
htdocs/tonica-imobiliaria/classes/ImovelDBI.js:42:55
     //Retorna um array com todos os imóveis cadastrados
     buscaImoveis() {
         let imoveis = [];
-        for (let i = 0; i < this.imoveis.length; i++) {
-            imoveis.push({...this.imoveis[i]});
-        }
+        for (let i = 0; i < this.imoveis.length; i++) {}
 
         return imoveis;
