[Killed] ConditionalExpression
htdocs/tonica-imobiliaria/classes/Imovel.js:24:25
 
         let imovel = this;
     
-        for (let i = 0; i < camposCaracteres.length; i++) {
+        for (let i = 0; false; i++) {
     
             //Testa se os campos de caractares possuem somente letras e espaços

[Killed] EqualityOperator
htdocs/tonica-imobiliaria/classes/Imovel.js:24:25
 
         let imovel = this;
     
-        for (let i = 0; i < camposCaracteres.length; i++) {
+        for (let i = 0; i <= camposCaracteres.length; i++) {
     
             //Testa se os campos de caractares possuem somente letras e espaços
